{
  "blogs": [
    {
      "id": "9bff",
      "title": "With Willie Mays gone, who is baseball's greatest living player?",
      "description": "Before his death Tuesday, Willie Mays was widely viewed as Major League Baseball's greatest living player.\n\nMays hit 660 career home runs and had numerous iconic plays, including \"The Catch\" in Game 1 of the 1954 World Series, placing him among the game's best.\n\nOn Wednesday, the Boston Globe's Bob Ryan pondered this question: \nKoufax is the only pitcher in MLB history to lead the league in wins, earned run average and strikeouts three times in his three Cy Young Award-winning seasons. For the final five years of his 12-year career, he was the best pitcher in baseball, posting a 1.95 ERA in 181 games (176 starts) from 1962-66.",
      "categories": "Sports",
      "imageurl": "https://res.cloudinary.com/dxufhhhbl/image/upload/v1718866415/vzy92bl67n4g9hprjocp.jpg",
      "date": "06/20/2024"
    },
    {
      "id": "93ec",
      "title": "Brittney Griner Makes Strong Statement After WNBA Announcement",
      "description": "Fresh off returning from injury, Brittney Griner quickly made her impact felt on the Phoenix Mercury. Now, she gave everyone a preview of her mindset that fueled her spectacular play on the court.\n\nGriner made her season debut for the Mercury on June 7 against the Minnesota Lynx after recovering from a fractured toe; and she immediately became a game-changer for the franchise. In fact, in the two games she played from June 10 to 16, she averaged 26.5 points, 9.0 rebounds, 1.5 assists and 2.0 blocks. As a result, she was named the Player of the Week for the West, along with Aliyah Boston for the East.\n\n",
      "categories": "Technology",
      "imageurl": "https://res.cloudinary.com/dxufhhhbl/image/upload/v1718877512/gg3wan8l40hupczgewza.jpg",
      "date": "06/20/2024"
    },
    {
      "id": "0350",
      "title": "11 Facts You Should Know About Canned Salmon",
      "description": "There are many things to love about canned fish, and canned salmon is one of the best types out there. Buying canned salmon is an affordable way to enjoy the omega-3-rich fish, and with minimal preparation. Not only is it nutritious, but the canning process preserves its wholesome qualities and nutrients, allowing you to enjoy it anytime, anywhere, for years after you've bought it. Plus, its versatility and precooked nature means that you can throw it into a mind-boggling amount of dishes in mere seconds.",
      "categories": "Food",
      "imageurl": "https://res.cloudinary.com/dxufhhhbl/image/upload/v1718885112/btnwtxjyvkacu0vm4p3u.jpg",
      "date": "06/20/2024"
    },
    {
      "id": "798b",
      "title": "Some life-saving food assistance entered South Darfur, UN says, but aid groups say more is needed",
      "description": "CAIRO (AP) — South Darfur saw a slight increase in critical aid when the U.N.'s World Food Program delivered life-saving food and nutrition to some families across the violence-riddled western Sudanese state, the organization said. But more assistance is needed, humanitarian organizations say.\n\nThe WFP mission in Sudan said Tuesday that more than 50,000 people in hunger hotspots across South Darfur are receiving much-needed food assistance in collaboration with relief agency World Vision.\n\nWFP didn’t give a time frame for when the aid was distributed or say how WFP delivered the supplies. Several spokespersons for the organization did not immediately respond to requests for additional information.\n\nF amine looms in parts of Suda n, which has been engulfed by violence since April of last year, when tensions between leaders of the Sudanese military and the paramilitary Rapid Support Forces erupted into intense fighting and spread across the country, including to Darfur. The U.N. says over 14,000 people have been killed and 33,000 injured.",
      "categories": "Food",
      "imageurl": "https://res.cloudinary.com/dxufhhhbl/image/upload/v1718885402/y2rnxtzktr1eza3xihuw.jpg",
      "date": "06/20/2024"
    },
    {
      "id": "cfe4",
      "title": "Intimidating tree-lined fairways of Sahalee await Nelly Korda and rest of field in the Women’s PGA",
      "description": "SAMMAMISH, Wash. (AP) — Inside her yardage book, Nelly Korda keeps the markings simple. The No. 1 player in the world denotes the spots she needs to avoid hitting by writing X’s.\n\nAt Sahalee Country Club, with Douglas fir, red cedar and hemlock trees framing every fairway and making each look like a hallway, there are likely to be a substantial amount of those X marks outside the short grass.\n\n“I think every hole looks a little different. They’re all intimidating and great in their own way,” Korda said.\n\nKorda is again the headliner this week as the KPMG Women’s PGA Championship tees off Thursday at Sahalee, the third major of the year on the LPGA Tour.\n\nBut she arrived in the Seattle area in a different place with her game than just a few weeks ago, when she showed up at the U.S. Women’s Open having won six of her previous seven starts, including a major at the Chevron Championship. At the time, no player in the world was on more of a roll than Korda and adding another major seemed probable, if not likely.\n\nADVERTISEMENT\n\nThat didn’t happen. Korda missed the cut at Lancaster Country Club after an opening-round 80 that included a 10 on her third hole and watched as Yuka Saso went on to win the championship for a second time. When she returned last week at the Meijer LPGA Classic, Korda struggled to an opening-round 76 before shooting 67 in the second round, but missed out on playing the weekend by one shot.\n\nRELATED COVERAGE",
      "categories": "Sports",
      "imageurl": "https://res.cloudinary.com/dxufhhhbl/image/upload/v1718896110/atp0ru1gjuoxigqgo1bw.jpg",
      "date": "06/20/2024"
    },
    {
      "id": "d87a",
      "title": " Earn money online – it is easy with MetroOpinion",
      "description": "Earning money online is quite easy with surveys from MetroOpinion.\n\nWe have optimized our software to find the most relevant surveys. More relevant surveys means more money for you.\n\nWhen we find a perfect survey for you, we will send you an invitation via email. It is important that you sign up with your primary email address. Registering with the email address you use regularly is the best way to earn money. If you do not participate when invited, the invitation will go to another member of MetroOpinion.\n\nPayment is easy with MetroOpinion. You can choose between multiple payment options. We have thousands of happy members of MetroOpinion that have received money from us.\n\nIt is fun to earn money with MetroOpinion. Companies use your answers to create better products. This means your answers make a difference.",
      "categories": "Sports",
      "imageurl": "https://res.cloudinary.com/dxufhhhbl/image/upload/v1718896188/axpiij1vmpbqdblr2owq.jpg",
      "date": "06/20/2024"
    }
  ]
}